# lec 1
## What is Data Analysis - Complete tutorial

#### Data Analysis is a processing of inspecting,cleaning,transforming, and modelling data with the goal of discovering useful information,informing conclusions,and supporting decision-making.

# python libraries for Data Analysis
1. Numpy
2. Pandas
3. Matplotlib
4. SciPy
5. Scikitlearn
6. Seaborn
7. statsmodel

### pandas means panel data

###  What is Pandas?
1. The name "pandas" has a reference to both "panel data",and "python data analysis", and was created by wes mckinney in 2008.
2. Pandas is apython library used for working with data sets.
3. It has functions for analyzing,cleaning, exploring and manipulating data.
4. Read and write data structures and different formats :csv,XML,JSON,ZIP etc.

#### Pandas vs Excel

1. To filter the data which contains large data sets in lakhs of data, it is not an easy task to work in excel.
2. Python has so many functions which will be helpful to work with such large amount of data and we can apply the filtering conditions to filter the data.

###  Pandas Data Structures

1. Series--> one dimensional labeled arrays.
2. DataFrame--> Two dimensional data structure with columns, much like a table.
3.Panel--> It is a 3D container of data.

### Importance of Pandas in Python
1. Pandas allows us to analyze the big data and make conclusions based on statistical theories.
2. Pandas can clean messy data sets and make them readable and relevant.
3. Easy handling of missing data (represented as NaN) in floating point as well as non-floating point data.
4. Size mutability: Columns can be inserted and deleted from DataFrame and higher dimensional objects.
5. Data set merging and joining: Flexible reshaping and pivoting of data sets provides real time-series funnctionality.

# lec 2
## Data structure Pandas

### Series is a one dimensional array that is capable of storing various data types.
 1. For a Series(), we can give arguments as data,index,name,dtype.
 2. index,name,dtype are optional.

In [5]:
import pandas as pd
s1=pd.Series([1,2,3,5,4,3,2,1])
print(s1)

0    1
1    2
2    3
3    5
4    4
5    3
6    2
7    1
dtype: int64

In [6]:
print(type(s1))
print(s1[5])

<class 'pandas.core.series.Series'>
3

In [14]:
a=[1,2,3,4,5,6,7,8,9,10,11,12,13,14]
s2=pd.Series([1,2,3,5,4,3,2,1],index=a[3:11]) # suppose we want some other different indexing,then we can give like this.
print(s2)

4     1
5     2
6     3
7     5
8     4
9     3
10    2
11    1
dtype: int64

In [16]:
s1=pd.Series([1,2,3,5,4,3,2,1],dtype="f",name="Series1")
print(s1)

0    1.0
1    2.0
2    3.0
3    5.0
4    4.0
5    3.0
6    2.0
7    1.0
Name: Series1, dtype: float32

#### if u give dictionary as input to series,then the keys will acts as indexes in the result. 
#### whenever there is mixed datatype, then we will get the result of dtype as Object.

In [20]:
s=pd.Series(12)
print(s)

0    12
dtype: int64

In [27]:
# suppose we want the same data 12 for many indexes, then we can use index paramter here.
s=pd.Series(12,index=[1,2,3,4,5,6,7,8,9,10])
print(s)

1     12
2     12
3     12
4     12
5     12
6     12
7     12
8     12
9     12
10    12
dtype: int64

In [28]:
s

1     12
2     12
3     12
4     12
5     12
6     12
7     12
8     12
9     12
10    12
dtype: int64

In [22]:
s1=pd.Series(12,index=[1,2,3,4,5,6,7,8,9,10])
print(s1)
s2=pd.Series(12,index=[1,2,3,4,5,6])
print(s2)

1     12
2     12
3     12
4     12
5     12
6     12
7     12
8     12
9     12
10    12
dtype: int64
1    12
2    12
3    12
4    12
5    12
6    12
dtype: int64

# here we have the missing data.
# suppose when we want to perform any mathematical operations on the missing data and if any data is missing,then we will get the result as NaN
# if we perform in numpy ,we will get any broadcasting error (if dimensions are not same) and we get the result if broadcasting is done.

In [24]:
s1+s2

1     24.0
2     24.0
3     24.0
4     24.0
5     24.0
6     24.0
7      NaN
8      NaN
9      NaN
10     NaN
dtype: float64

In [25]:
s1-s2

1     0.0
2     0.0
3     0.0
4     0.0
5     0.0
6     0.0
7     NaN
8     NaN
9     NaN
10    NaN
dtype: float64

# lec 3
## Basics of DataFrames in Pandas

In [36]:
import pandas as pd
d1=pd.DataFrame([1,2,3,5,4,3,2,1]) # along the single column, it will shows the data.
print(d1) # it will results as a table type.
print(type(d1))

   0
0  1
1  2
2  3
3  5
4  4
5  3
6  2
7  1
<class 'pandas.core.frame.DataFrame'>

In [37]:
d1

   0
0  1
1  2
2  3
3  5
4  4
5  3
6  2
7  1

In [56]:
import pandas as pd
# to pass mutiple lists,pass them as list of lists.
d2=pd.DataFrame([[1,2,3,5,4,3,2,1],[11,23,234,55,74,73,22,91],[18,27,33,55,43,36,28,121]]) #here it is 2D array we used.
print(d2)

    0   1    2   3   4   5   6    7
0   1   2    3   5   4   3   2    1
1  11  23  234  55  74  73  22   91
2  18  27   33  55  43  36  28  121

In [57]:
d2=pd.DataFrame([[1,2,3,5,4,3,2,1],[11,23,234,55,74,73,22,91]])
print(d2)

    0   1    2   3   4   5   6   7
0   1   2    3   5   4   3   2   1
1  11  23  234  55  74  73  22  91

In [72]:
# if u want to pass the list as in column wise, then we need to convert lists to series and then combine them in dictionary .
l1=[1,2,3,4,5]
l2=[6,7,8,9,10]
data={"a":pd.Series(l1),"b":pd.Series(l2)}
d5=pd.DataFrame(data)
print(d5)

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [58]:
### passing dictionary to a dataframe
# keys are acting as columns here.
dict1={"Names":["Phani","Indra","Lucky","Spoorti","Akshu"],"Marks":[90,97,93,95]}
d3=pd.DataFrame(dict1)
 # ValueError: All arrays must be of the same length

ValueError: All arrays must be of the same length

In [59]:
dict1={"Names":["Phani","Indra","Lucky","Spoorti","Akshu"],"Marks":[90,97,93,95,87]}
d3=pd.DataFrame(dict1)
print(d3)

     Names  Marks
0    Phani     90
1    Indra     97
2    Lucky     93
3  Spoorti     95
4    Akshu     87

In [61]:
# when u want only names column in the result, we can use columns argument here.
dict1={"Names":["Phani","Indra","Lucky","Spoorti","Akshu"],"Marks":[90,97,93,95,87]}
d3=pd.DataFrame(dict1,columns=["Names"])
print(d3)

     Names
0    Phani
1    Indra
2    Lucky
3  Spoorti
4    Akshu

In [63]:
dict1={"Names":["Phani","Indra","Lucky","Spoorti","Akshu"],"Marks":[90,97,93,95,87]}
d3=pd.DataFrame(dict1,columns=["Names","Marks"]) # to get both rows and columns .
print(d3)

     Names  Marks
0    Phani     90
1    Indra     97
2    Lucky     93
3  Spoorti     95
4    Akshu     87

In [64]:
# we can also give the indexes here if we don't want to start from zero.
dict1={"Names":["Phani","Indra","Lucky","Spoorti","Akshu"],"Marks":[90,97,93,95,87]}
d3=pd.DataFrame(dict1,columns=["Names","Marks"],index=[1,2,3,4,5]) # to get both rows and columns .
print(d3)

     Names  Marks
1    Phani     90
2    Indra     97
3    Lucky     93
4  Spoorti     95
5    Akshu     87

In [69]:
d3['Names'][3]

'Lucky'

In [70]:
d3['Names']

1      Phani
2      Indra
3      Lucky
4    Spoorti
5      Akshu
Name: Names, dtype: object

# lec 4
## What are Arithmetic operations in Python Pandas

In [73]:
d5

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [75]:
# to add columns just give their names and assign with new name with name of dataframe
d5['a+b']=d5['a']+d5['b']

In [76]:
print(d5)

   a   b  a+b
0  1   6    7
1  2   7    9
2  3   8   11
3  4   9   13
4  5  10   15

In [80]:
d5['a-b']=d5['a']-d5['b']
d5['a*b']=d5['a']*d5['b']
d5['a/b']=d5['a']/d5['b']
d5['a**b']=d5['a']**d5['b']
d5['a%b']=d5['a']%d5['b']

In [81]:
d5

   a   b  a+b  a-b  a*b       a/b     a**b  a%b
0  1   6    7   -5    6  0.166667        1    1
1  2   7    9   -5   14  0.285714      128    2
2  3   8   11   -5   24  0.375000     6561    3
3  4   9   13   -5   36  0.444444   262144    4
4  5  10   15   -5   50  0.500000  9765625    5

In [82]:
# we will create a new column and check some condition
d5['a<4']=d5['a']<4

In [83]:
print(d5)

   a   b  a+b  a-b  a*b       a/b     a**b  a%b    a<4
0  1   6    7   -5    6  0.166667        1    1   True
1  2   7    9   -5   14  0.285714      128    2   True
2  3   8   11   -5   24  0.375000     6561    3   True
3  4   9   13   -5   36  0.444444   262144    4  False
4  5  10   15   -5   50  0.500000  9765625    5  False

# lec 5
## How to delete and insert Data in Pandas

In [84]:
d5

   a   b  a+b  a-b  a*b       a/b     a**b  a%b    a<4
0  1   6    7   -5    6  0.166667        1    1   True
1  2   7    9   -5   14  0.285714      128    2   True
2  3   8   11   -5   24  0.375000     6561    3   True
3  4   9   13   -5   36  0.444444   262144    4  False
4  5  10   15   -5   50  0.500000  9765625    5  False

# insert

1. insert() has 3 parameters. index number position(column wise index),name of the column,data to insert
###### for above d5,we can see that  a has index 0 ,b has index 1...

In [85]:
d5.insert(2,'a+2',[3,4,5,6,7]) # see that at index 2 we got the a+2 column.

In [104]:
d5.insert(2,'a++',[3,4,5,6,7,8,9]) # the lengths should match here.

ValueError: Length of values (7) does not match length of index (5)

In [86]:
d5

   a   b  a+2  a+b  a-b  a*b       a/b     a**b  a%b    a<4
0  1   6    3    7   -5    6  0.166667        1    1   True
1  2   7    4    9   -5   14  0.285714      128    2   True
2  3   8    5   11   -5   24  0.375000     6561    3   True
3  4   9    6   13   -5   36  0.444444   262144    4  False
4  5  10    7   15   -5   50  0.500000  9765625    5  False

In [91]:
d5.insert(5,'copy of a+b', d5['a']+d5['b'])

In [92]:
d5

,a,b,copy of a,a+2,a+b,copy of a+b,copy of a,a-b,a*b,a/b,a**b,a%b,a<4
0,1,6,1,3,7,7,7,-5,6,0.166667,1,1,True
1,2,7,2,4,9,9,9,-5,14,0.285714,128,2,True
2,3,8,3,5,11,11,11,-5,24,0.375000,6561,3,True
3,4,9,4,6,13,13,13,-5,36,0.444444,262144,4,False
4,5,10,5,7,15,15,15,-5,50,0.500000,9765625,5,False

In [101]:
d5.insert(2,'a once',d5['a'])  # just run only once here.
d5.insert(2,'a twice',d5['a']) # see here the column is created with the same data which 'a' haves.
# once the column is created again we cannot create second time with same name since the column is already exists here.
# since i ran twice,the error is there.

ValueError: cannot insert a once, already exists

In [102]:
d5

,a,b,a twice,a once,copy of a,a+2,a+b,copy of a+b,copy of a,a-b,a*b,a/b,a**b,a%b,a<4
0,1,6,1,1,1,3,7,7,7,-5,6,0.166667,1,1,True
1,2,7,2,2,2,4,9,9,9,-5,14,0.285714,128,2,True
2,3,8,3,3,3,5,11,11,11,-5,24,0.375000,6561,3,True
3,4,9,4,4,4,6,13,13,13,-5,36,0.444444,262144,4,False
4,5,10,5,5,5,7,15,15,15,-5,50,0.500000,9765625,5,False

In [109]:
# suppose we need to create a bew column where we need to copy  only certain range of elements.
d5['new_col']=d5['a'][0:3] # a new column is created with values upto 0 1 2 indexes of a such as 1 2 3 and remaining values filled with NaN

In [110]:
d5

,a,b,a twice,a once,copy of a,a+2,a+b,copy of a+b,copy of a,a-b,a*b,a/b,a**b,a%b,a<4,new_col
0,1,6,1,1,1,3,7,7,7,-5,6,0.166667,1,1,True,1.0
1,2,7,2,2,2,4,9,9,9,-5,14,0.285714,128,2,True,2.0
2,3,8,3,3,3,5,11,11,11,-5,24,0.375000,6561,3,True,3.0
3,4,9,4,4,4,6,13,13,13,-5,36,0.444444,262144,4,False,NaN
4,5,10,5,5,5,7,15,15,15,-5,50,0.500000,9765625,5,False,NaN

# delete

In [111]:
del d5['copy of a'] # this column will be deleted .

In [112]:
d5

,a,b,a twice,a once,copy of a,a+2,a+b,copy of a+b,a-b,a*b,a/b,a**b,a%b,a<4,new_col
0,1,6,1,1,1,3,7,7,-5,6,0.166667,1,1,True,1.0
1,2,7,2,2,2,4,9,9,-5,14,0.285714,128,2,True,2.0
2,3,8,3,3,3,5,11,11,-5,24,0.375000,6561,3,True,3.0
3,4,9,4,4,4,6,13,13,-5,36,0.444444,262144,4,False,NaN
4,5,10,5,5,5,7,15,15,-5,50,0.500000,9765625,5,False,NaN

In [115]:
d5.pop('a/b') # this column will be removed from the table

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
Name: a/b, dtype: float64

In [116]:
d5

,a,b,a twice,a once,copy of a,a+2,a+b,copy of a+b,a-b,a*b,a**b,a%b,a<4,new_col
0,1,6,1,1,1,3,7,7,-5,6,1,1,True,1.0
1,2,7,2,2,2,4,9,9,-5,14,128,2,True,2.0
2,3,8,3,3,3,5,11,11,-5,24,6561,3,True,3.0
3,4,9,4,4,4,6,13,13,-5,36,262144,4,False,NaN
4,5,10,5,5,5,7,15,15,-5,50,9765625,5,False,NaN

# lec 6
## Python Pandas CSV files

### Difference between CSV and XLS (excel) file formats:

1. CSV format is a plain text format in which values are separated by commas(Comma Separated Values)
2. XLS file format is an Excel sheets binary file format which holds information about all the workshops in a file,including both content and formatting.

# write CSV

In [117]:
import pandas as pd
print(d5)

   a   b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  a*b  \
0  1   6        1       1           1    3    7            7   -5    6
1  2   7        2       2           2    4    9            9   -5   14
2  3   8        3       3           3    5   11           11   -5   24
3  4   9        4       4           4    6   13           13   -5   36
4  5  10        5       5           5    7   15           15   -5   50

      a**b  a%b    a<4  new_col
0        1    1   True      1.0
1      128    2   True      2.0
2     6561    3   True      3.0
3   262144    4  False      NaN
4  9765625    5  False      NaN

In [122]:
d5.to_csv("CSV file1.csv") # in this file there will be indexes also present
 # 'C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech' --> at this location this file will be generated.

In [123]:
import os
os.getcwd()

'C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech'

In [124]:
d5.to_csv("CSV file1 without indexes.csv",index=False)

In [129]:
# we can give the header also here.
# the column names are replaced by these header values here.
d5.to_csv("CSV file1 with header1.csv",index=False,header=[1,2,3,4,5,6,7,8,9,10,11,12,13,14])

# lec 7
## Read  python CSV files-with PANDAS

# CSV files
1. A simple way to store big data sets is to use CSV files.
2. CSV files contaisn plain text and is a well known format that can be read by everyone including Pandas.

# In excel or csv files, there includes a very large amount of datasets which is very tough to work in the excel .
# suppose any values are missing in the 2000 row.we cannot check every row since there are millions of rows there.
# By using Numpy and pandas,we will apply some conditions here and work out on the missing data.

In [132]:
import pandas as pd
cs1=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv")
print(cs1)
# we need to convert it into dataframe
df1=pd.DataFrame(cs1)
print(df1)

   Unnamed: 0  a   b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  \
0           0  1   6        1       1           1    3    7            7   -5
1           1  2   7        2       2           2    4    9            9   -5
2           2  3   8        3       3           3    5   11           11   -5
3           3  4   9        4       4           4    6   13           13   -5
4           4  5  10        5       5           5    7   15           15   -5

   a*b     a**b  a%b    a<4  new_col
0    6        1    1   True      1.0
1   14      128    2   True      2.0
2   24     6561    3   True      3.0
3   36   262144    4  False      NaN
4   50  9765625    5  False      NaN
   Unnamed: 0  a   b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  \
0           0  1   6        1       1           1    3    7            7   -5
1           1  2   7        2       2           2    4    9            9   -5
2           2  3   8        3       3           3    5   11           11   -5
3           3  4   9        4       4           4    6   13           13   -5
4           4  5  10        5       5           5    7   15           15   -5

   a*b     a**b  a%b    a<4  new_col
0    6        1    1   True      1.0
1   14      128    2   True      2.0
2   24     6561    3   True      3.0
3   36   262144    4  False      NaN
4   50  9765625    5  False      NaN

In [136]:
# in read_csv(),we can also perform some more parameters here.
# we want to read only some rows ex-:3 here instead of all the data.
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",nrows=3)
print(cs2)
print()
print(pd.DataFrame(cs2))

   Unnamed: 0  a  b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  \
0           0  1  6        1       1           1    3    7            7   -5
1           1  2  7        2       2           2    4    9            9   -5
2           2  3  8        3       3           3    5   11           11   -5

   a*b  a**b  a%b   a<4  new_col
0    6     1    1  True      1.0
1   14   128    2  True      2.0
2   24  6561    3  True      3.0

   Unnamed: 0  a  b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  \
0           0  1  6        1       1           1    3    7            7   -5
1           1  2  7        2       2           2    4    9            9   -5
2           2  3  8        3       3           3    5   11           11   -5

   a*b  a**b  a%b   a<4  new_col
0    6     1    1  True      1.0
1   14   128    2  True      2.0
2   24  6561    3  True      3.0

In [138]:
# suppose we want to read only some columns from the csv file, then we can use usecols keyword here.
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",usecols=["b","a+b"])
print(cs2) # we can give as many as columns we want in the usecols.
print()
print(pd.DataFrame(cs2))

    b  a+b
0   6    7
1   7    9
2   8   11
3   9   13
4  10   15

    b  a+b
0   6    7
1   7    9
2   8   11
3   9   13
4  10   15

In [139]:
# instead of names ,we can also give the column indexes in usecols.
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",usecols=[0,3,7])
print(cs2)
print()
print(pd.DataFrame(cs2))

   Unnamed: 0  a twice  a+b
0           0        1    7
1           1        2    9
2           2        3   11
3           3        4   13
4           4        5   15

   Unnamed: 0  a twice  a+b
0           0        1    7
1           1        2    9
2           2        3   11
3           3        4   13
4           4        5   15

In [141]:
# we can also skip rows whatever we don't want.
# here we will try to skip the rows with indexes 0 and 3.
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",skiprows=[0,3])
print(cs2)
print()
print(pd.DataFrame(cs2))

   0  1   6  1.1  1.2  1.3  3   7  7.1  -5  6.1      1.4  1.5   True  1.0
0  1  2   7    2    2    2  4   9    9  -5   14      128    2   True  2.0
1  3  4   9    4    4    4  6  13   13  -5   36   262144    4  False  NaN
2  4  5  10    5    5    5  7  15   15  -5   50  9765625    5  False  NaN

   0  1   6  1.1  1.2  1.3  3   7  7.1  -5  6.1      1.4  1.5   True  1.0
0  1  2   7    2    2    2  4   9    9  -5   14      128    2   True  2.0
1  3  4   9    4    4    4  6  13   13  -5   36   262144    4  False  NaN
2  4  5  10    5    5    5  7  15   15  -5   50  9765625    5  False  NaN

In [143]:
# we want any one of the column to acts as index,then we can use the index_col for it.
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",index_col="b")
print(cs2)
print()
print(pd.DataFrame(cs2)) # here column b will acts as index for the table.

    Unnamed: 0  a  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  \
b
6            0  1        1       1           1    3    7            7   -5
7            1  2        2       2           2    4    9            9   -5
8            2  3        3       3           3    5   11           11   -5
9            3  4        4       4           4    6   13           13   -5
10           4  5        5       5           5    7   15           15   -5

    a*b     a**b  a%b    a<4  new_col
b
6     6        1    1   True      1.0
7    14      128    2   True      2.0
8    24     6561    3   True      3.0
9    36   262144    4  False      NaN
10   50  9765625    5  False      NaN

    Unnamed: 0  a  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  \
b
6            0  1        1       1           1    3    7            7   -5
7            1  2        2       2           2    4    9            9   -5
8            2  3        3       3           3    5   11           11   -5
9            3  4        4       4           4    6   13           13   -5
10           4  5        5       5           5    7   15           15   -5

    a*b     a**b  a%b    a<4  new_col
b
6     6        1    1   True      1.0
7    14      128    2   True      2.0
8    24     6561    3   True      3.0
9    36   262144    4  False      NaN
10   50  9765625    5  False      NaN

In [145]:
# we want any one of the row to act as a header for the table.
# for that we can use the header keyword here.
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",header=3)
print(cs2)
print()
print(pd.DataFrame(cs2))  #here thr row with index 3 will acts as header for the table.

   2  3   8  3.1  3.2  3.3  5  11  11.1  -5  24     6561  3.4   True  3.0
0  3  4   9    4    4    4  6  13    13  -5  36   262144    4  False  NaN
1  4  5  10    5    5    5  7  15    15  -5  50  9765625    5  False  NaN

   2  3   8  3.1  3.2  3.3  5  11  11.1  -5  24     6561  3.4   True  3.0
0  3  4   9    4    4    4  6  13    13  -5  36   262144    4  False  NaN
1  4  5  10    5    5    5  7  15    15  -5  50  9765625    5  False  NaN

In [146]:
# here we will give the heading of the table for some columns and  name it as "Indra"
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",names=["Indra"])
print(cs2)
print()
print(pd.DataFrame(cs2))

                                                                                    Indra
NaN a b  a twice a once  copy of a a+2 a+b copy of a+b a-b a*b a**b    a%b a<4    new_col
0.0 1 6  1       1      1          3   7   7           -5  6   1       1   True       1.0
1.0 2 7  2       2      2          4   9   9           -5  14  128     2   True       2.0
2.0 3 8  3       3      3          5   11  11          -5  24  6561    3   True       3.0
3.0 4 9  4       4      4          6   13  13          -5  36  262144  4   False      NaN
4.0 5 10 5       5      5          7   15  15          -5  50  9765625 5   False      NaN

                                                                                    Indra
NaN a b  a twice a once  copy of a a+2 a+b copy of a+b a-b a*b a**b    a%b a<4    new_col
0.0 1 6  1       1      1          3   7   7           -5  6   1       1   True       1.0
1.0 2 7  2       2      2          4   9   9           -5  14  128     2   True       2.0
2.0 3 8  3       3      3          5   11  11          -5  24  6561    3   True       3.0
3.0 4 9  4       4      4          6   13  13          -5  36  262144  4   False      NaN
4.0 5 10 5       5      5          7   15  15          -5  50  9765625 5   False      NaN

In [148]:
# for the columns we are giving names here.
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",names=["c1","c2","c3","c4","c5","c6","c7","c8","c9","c10","c11"])
print(cs2)
print()
print(pd.DataFrame(cs2))

                      c1          c2   c3   c4           c5   c6   c7  \
NaN a b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  a*b
0.0 1 6  1             1           1    3    7            7   -5    6
1.0 2 7  2             2           2    4    9            9   -5   14
2.0 3 8  3             3           3    5   11           11   -5   24
3.0 4 9  4             4           4    6   13           13   -5   36
4.0 5 10 5             5           5    7   15           15   -5   50

                       c8   c9    c10      c11
NaN a b  a twice     a**b  a%b    a<4  new_col
0.0 1 6  1              1    1   True      1.0
1.0 2 7  2            128    2   True      2.0
2.0 3 8  3           6561    3   True      3.0
3.0 4 9  4         262144    4  False      NaN
4.0 5 10 5        9765625    5  False      NaN

                      c1          c2   c3   c4           c5   c6   c7  \
NaN a b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  a*b
0.0 1 6  1             1           1    3    7            7   -5    6
1.0 2 7  2             2           2    4    9            9   -5   14
2.0 3 8  3             3           3    5   11           11   -5   24
3.0 4 9  4             4           4    6   13           13   -5   36
4.0 5 10 5             5           5    7   15           15   -5   50

                       c8   c9    c10      c11
NaN a b  a twice     a**b  a%b    a<4  new_col
0.0 1 6  1              1    1   True      1.0
1.0 2 7  2            128    2   True      2.0
2.0 3 8  3           6561    3   True      3.0
3.0 4 9  4         262144    4  False      NaN
4.0 5 10 5        9765625    5  False      NaN

In [150]:
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",header=None)
print(cs2)
print()
print(pd.DataFrame(cs2)) # gives the default values in the header.

    0  1   2        3       4           5    6    7            8    9    10  \
0  NaN  a   b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  a*b
1  0.0  1   6        1       1           1    3    7            7   -5    6
2  1.0  2   7        2       2           2    4    9            9   -5   14
3  2.0  3   8        3       3           3    5   11           11   -5   24
4  3.0  4   9        4       4           4    6   13           13   -5   36
5  4.0  5  10        5       5           5    7   15           15   -5   50

        11   12     13       14
0     a**b  a%b    a<4  new_col
1        1    1   True      1.0
2      128    2   True      2.0
3     6561    3   True      3.0
4   262144    4  False      NaN
5  9765625    5  False      NaN

    0  1   2        3       4           5    6    7            8    9    10  \
0  NaN  a   b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b  a*b
1  0.0  1   6        1       1           1    3    7            7   -5    6
2  1.0  2   7        2       2           2    4    9            9   -5   14
3  2.0  3   8        3       3           3    5   11           11   -5   24
4  3.0  4   9        4       4           4    6   13           13   -5   36
5  4.0  5  10        5       5           5    7   15           15   -5   50

        11   12     13       14
0     a**b  a%b    a<4  new_col
1        1    1   True      1.0
2      128    2   True      2.0
3     6561    3   True      3.0
4   262144    4  False      NaN
5  9765625    5  False      NaN

In [152]:
# along with indexes such as 0 1 2 3,we can also add the prefixes such as col etc.
cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",header=None,prefix="col")
print(cs2)
print()
print(pd.DataFrame(cs2))

   col0 col1 col2     col3    col4        col5 col6 col7         col8 col9  \
0   NaN    a    b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b
1   0.0    1    6        1       1           1    3    7            7   -5
2   1.0    2    7        2       2           2    4    9            9   -5
3   2.0    3    8        3       3           3    5   11           11   -5
4   3.0    4    9        4       4           4    6   13           13   -5
5   4.0    5   10        5       5           5    7   15           15   -5

  col10    col11 col12  col13    col14
0   a*b     a**b   a%b    a<4  new_col
1     6        1     1   True      1.0
2    14      128     2   True      2.0
3    24     6561     3   True      3.0
4    36   262144     4  False      NaN
5    50  9765625     5  False      NaN

   col0 col1 col2     col3    col4        col5 col6 col7         col8 col9  \
0   NaN    a    b  a twice  a once   copy of a  a+2  a+b  copy of a+b  a-b
1   0.0    1    6        1       1           1    3    7            7   -5
2   1.0    2    7        2       2           2    4    9            9   -5
3   2.0    3    8        3       3           3    5   11           11   -5
4   3.0    4    9        4       4           4    6   13           13   -5
5   4.0    5   10        5       5           5    7   15           15   -5

  col10    col11 col12  col13    col14
0   a*b     a**b   a%b    a<4  new_col
1     6        1     1   True      1.0
2    14      128     2   True      2.0
3    24     6561     3   True      3.0
4    36   262144     4  False      NaN
5    50  9765625     5  False      NaN

C:\Users\Phanindra Reddy\AppData\Local\Temp\ipykernel_16072\275521145.py:2: FutureWarning: The prefix argument has been deprecated and will be removed in a future version. Use a list comprehension on the column names in the future.


  cs2=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",header=None,prefix="col")

In [153]:
# suppose we want to convert any column  data into another datatype,then we can use the dtype and dictionary.
import pandas as pd
cs1=pd.read_csv("C:\\Users\\Phanindra Reddy\\PANDAS youtube\\Wscube tech\\CSV file1.csv",dtype={"b":"float"})
print(cs1) # here b will have the float datatype.
df1=pd.DataFrame(cs1)
print(df1)

   Unnamed: 0  a     b  a twice  a once   copy of a  a+2  a+b  copy of a+b  \
0           0  1   6.0        1       1           1    3    7            7
1           1  2   7.0        2       2           2    4    9            9
2           2  3   8.0        3       3           3    5   11           11
3           3  4   9.0        4       4           4    6   13           13
4           4  5  10.0        5       5           5    7   15           15

   a-b  a*b     a**b  a%b    a<4  new_col
0   -5    6        1    1   True      1.0
1   -5   14      128    2   True      2.0
2   -5   24     6561    3   True      3.0
3   -5   36   262144    4  False      NaN
4   -5   50  9765625    5  False      NaN
   Unnamed: 0  a     b  a twice  a once   copy of a  a+2  a+b  copy of a+b  \
0           0  1   6.0        1       1           1    3    7            7
1           1  2   7.0        2       2           2    4    9            9
2           2  3   8.0        3       3           3    5   11           11
3           3  4   9.0        4       4           4    6   13           13
4           4  5  10.0        5       5           5    7   15           15

   a-b  a*b     a**b  a%b    a<4  new_col
0   -5    6        1    1   True      1.0
1   -5   14      128    2   True      2.0
2   -5   24     6561    3   True      3.0
3   -5   36   262144    4  False      NaN
4   -5   50  9765625    5  False      NaN